In [2]:
import pandas as pd
import numpy as np

In [3]:
sat = pd.read_csv('scores.csv')

In [4]:
sat.head()

,School Name,Borough,Student Enrollment,Percent Tested,SAT Section,Score
0,A. Philip Randolph Campus High School,Manhattan,1354,74.00%,Math,459
1,A. Philip Randolph Campus High School,Manhattan,1354,74.00%,Reading,453
2,A. Philip Randolph Campus High School,Manhattan,1354,74.00%,Writing,447
3,Abraham Lincoln High School,Brooklyn,2341,54.90%,Math,441
4,Abraham Lincoln High School,Brooklyn,2341,54.90%,Reading,422

In [10]:
sat['Percent Tested'] = sat['Percent Tested'].replace(regex='%', value='').astype(float)

In [11]:
sat

,School Name,Borough,Student Enrollment,Percent Tested,SAT Section,Score
0,A. Philip Randolph Campus High School,Manhattan,1354,74.0,Math,459
1,A. Philip Randolph Campus High School,Manhattan,1354,74.0,Reading,453
2,A. Philip Randolph Campus High School,Manhattan,1354,74.0,Writing,447
3,Abraham Lincoln High School,Brooklyn,2341,54.9,Math,441
4,Abraham Lincoln High School,Brooklyn,2341,54.9,Reading,422
...,...,...,...,...,...,...
1120,Young Women's Leadership School in Astoria,Queens,572,100.0,Reading,464
1121,Young Women's Leadership School in Astoria,Queens,572,100.0,Writing,477
1122,Young Women's Leadership School in Queens,Queens,557,90.4,Math,415
1123,Young Women's Leadership School in Queens,Queens,557,90.4,Reading,420
1124,Young Women's Leadership School in Queens,Queens,557,90.4,Writing,433

In [12]:
sat

,School Name,Borough,Student Enrollment,Percent Tested,SAT Section,Score
0,A. Philip Randolph Campus High School,Manhattan,1354,74.0,Math,459
1,A. Philip Randolph Campus High School,Manhattan,1354,74.0,Reading,453
2,A. Philip Randolph Campus High School,Manhattan,1354,74.0,Writing,447
3,Abraham Lincoln High School,Brooklyn,2341,54.9,Math,441
4,Abraham Lincoln High School,Brooklyn,2341,54.9,Reading,422
...,...,...,...,...,...,...
1120,Young Women's Leadership School in Astoria,Queens,572,100.0,Reading,464
1121,Young Women's Leadership School in Astoria,Queens,572,100.0,Writing,477
1122,Young Women's Leadership School in Queens,Queens,557,90.4,Math,415
1123,Young Women's Leadership School in Queens,Queens,557,90.4,Reading,420
1124,Young Women's Leadership School in Queens,Queens,557,90.4,Writing,433

In [17]:
pivoted = sat.pivot(index='School Name', columns='SAT Section', values='Score')

In [23]:
pivoted.reset_index().melt(id_vars='School Name', value_name='Score')

                                            School Name SAT Section  Score
0                 A. Philip Randolph Campus High School        Math    459
1                           ACORN Community High School        Math    379
2                           Abraham Lincoln High School        Math    441
3            Academy for Careers in Television and Film        Math    444
4     Academy for College Preparation and Career Exp...        Math    386
...                                                 ...         ...    ...
1120       World Journalism Preparatory (College Board)     Writing    487
1121                         York Early College Academy     Writing    473
1122                    Young Women's Leadership School     Writing    472
1123         Young Women's Leadership School in Astoria     Writing    477
1124          Young Women's Leadership School in Queens     Writing    433

[1125 rows x 3 columns]

In [24]:
sat.pivot_table(index='School Name', columns='SAT Section', values='Score')

SAT Section                                         Math  Reading  Writing
School Name
A. Philip Randolph Campus High School                459      453      447
ACORN Community High School                          379      395      385
Abraham Lincoln High School                          441      422      422
Academy for Careers in Television and Film           444      458      444
Academy for College Preparation and Career Expl...   386      397      393
...                                                  ...      ...      ...
World Journalism Preparatory (College Board)         484      491      487
York Early College Academy                           496      481      473
Young Women's Leadership School                      478      465      472
Young Women's Leadership School in Astoria           483      464      477
Young Women's Leadership School in Queens            415      420      433

[375 rows x 3 columns]

In [31]:
sat.pivot_table(index='Borough', columns='SAT Section', values='Score', aggfunc='max', margins=True)

SAT Section    Math  Reading  Writing  All
Borough
Bronx           714      672      672  714
Brooklyn        682      608      606  682
Manhattan       754      697      693  754
Queens          701      640      661  701
Staten Island   711      660      670  711
All             754      697      693  754

In [34]:
sat.pivot_table(index='Borough', columns='SAT Section', values='Score', aggfunc='max', margins=True, margins_name='Grand Total')

SAT Section    Math  Reading  Writing  Grand Total
Borough
Bronx           714      672      672          714
Brooklyn        682      608      606          682
Manhattan       754      697      693          754
Queens          701      640      661          701
Staten Island   711      660      670          711
Grand Total     754      697      693          754

In [35]:
sat.pivot_table(index='Borough', columns='SAT Section', values='Score', aggfunc=['max', 'min'], margins=True, margins_name='Grand Total')

               max                              min                  \
SAT Section   Math Reading Writing Grand Total Math Reading Writing
Borough
Bronx          714     672     672         714  317     311     292
Brooklyn       682     608     606         682  319     302     284
Manhattan      754     697     693         754  344     330     316
Queens         701     640     661         701  340     320     318
Staten Island  711     660     670         711  420     427     409
Grand Total    754     697     693         754  317     302     284


SAT Section   Grand Total
Borough
Bronx                 292
Brooklyn              284
Manhattan             316
Queens                318
Staten Island         409
Grand Total           284